# RbsEnergyAnalysisSurfaceCadobjectid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisSurfaceCadobjectid Property
ParameterTypeId Class See Also
---
"CADObjectID"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisSurfaceCadobjectid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisSurfaceCadobjectid As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisSurfaceCadobjectid {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace